// Lab_03_1.cpp
// <Чапля Максим>
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 34

#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    double x; // вхідний параметр
    double y; // результат обчислення виразу
    double A; // функціонально стала частина виразу
    double B; // функціонально змінна частина виразу

    cout << "x = ";
    cin >> x;

    // Обчислення функціонально сталої частини виразу
    A = 2 * x * x;

    // спосіб 1: розгалуження в скороченій формі
    if (x <= -0.1)
        B = 5 * sin(3 * x);
    else if (x < 1.2)
        B = atan((x + 1) / 4);
    else
        B = tan(x) + 2;

    y = A - B;
    cout << endl;
    cout << "1) y = " << y << endl;

    // спосіб 2: розгалуження в повній формі
    if (x <= -0.1)
        B = 5 * sin(3 * x);
    else if (x < 1.2)
        B = atan((x + 1) / 4);
    else
        B = tan(x) + 2;

    y = A - B;
    cout << "2) y = " << y << endl;

    return 0;
}
